{
	"posts": {
		"StartyourfirstgamewithElm": {
			"id": "StartyourfirstgamewithElm",
			"title": "Start your first game with Elm",
			"date": "April 13, 2016",
			"summary": "Elm is a fully functional language and it is in your browser that is the thing I love about it! UI side Functional development.It is pretty fast comparing to other available UI frameworks out there. Here is the performance result from todoMVC benchmark comparison",
			"Content": "Start your first game with Elm. Elm is a fully functional language and it is in your browser that is the thing I love about it!UI side Functional development.It is pretty fast comparing to other available UI frameworks out there.Here is the performance result from[TodoMVCBenchmark](https: //evancz.github.io/todomvc-perf-comparison/):![alt](http: //www.4shared.com/download/_A3cnKnPce/todoMVC.png?sbsr=e486320cd92b34c4d93e762b9adf2c49964&lgfp=3000)You may ask your self why Elm is so fast they are many reason one is leveraging the < b > virtual DOM < /b>."
		},
		"RIPOver-EngineeredBlog": {
			"id": "RIPOver-EngineeredBlog",
			"title": "RIP Over-Engineered Blog",
			"date": "April 01, 2016",
			"summary": "It’s been 6 months since my last blog rewrite, so it’s time for another one. This time, let’s subtract."
		},
		"MovingBreakpointsIntelligently": {
			"id": "MovingBreakpointsIntelligently",
			"title": "Moving Breakpoints Intelligently",
			"date": "February 26, 2016",
			"summary": "In most debuggers, a breakpoint will 'slide' if the clicked line doesn't have any code. This is supposed to be a helpful feature,but it becomes **infuriating** if it behaves wrongly. In Firefox 46, we made our breakpoint sliding algorithm much more robust."
		},
		"OntheRoadtoBetterSourcemapsintheFirefoxDeveloperTools": {
			"id": "OntheRoadtoBetterSourcemapsintheFirefoxDeveloperTools",
			"title": "On the Road to Better Sourcemaps in the Firefox Developer Tools",
			"date": "January 11, 2016",
			"summary": "In this post, I explain why it has taken so long to get the Firefox console sourcemapped.It requires an unobtrusive debug mode which is really hard to do, but we got it working. The console now has access to sourcemaps, so we are only one small step away from getting it working."
		}
	}
}